<?php
/**
 * параметры Земли
 * Date: 25.11.19
 * Time: 19:42
 */
/**
 * Эллиптическая траектория движения Земли вокруг Солнца
 *  иллюстрация sin(a) = a при малом a
 *pi/500: 0.0062831853071796; 0.006283143965559
 *pi/600: 0.005235987755983; 0.0052359638314196
 *pi/700: 0.0044879895051283; 0.0044879744389254
 *pi/800: 0.0039269908169872; 0.003926980723806
 * фрагмент таблицы перигелия, офелия орбиты Земли
 * http://www.astropixels.com/ephemeris/perap2001.html
 *
Year      Date/Time of    Distance     Relative to     Date/Time of    Distance     Relative to    Perihelion
          Perihelion                    Mean Per.      Aphelion                     Mean Ap.       Interval

2011     Jan 03  18:32   0.9833413 AU    7681 km      Jul 04  14:54   1.0167404 AU    4501 km     365.77 days
2012     Jan 05  00:32   0.9832841 AU    -871 km      Jul 05  03:32   1.0166751 AU   -5270 km     366.25 days
2013     Jan 02  04:38   0.9832905 AU      82 km      Jul 05  14:44   1.0167085 AU    -268 km     363.17 days
2014     Jan 04  11:59   0.9833347 AU    6701 km      Jul 04  00:13   1.0166816 AU   -4287 km     367.31 days
2015     Jan 04  06:36   0.9832774 AU   -1874 km      Jul 06  19:40   1.0166821 AU   -4214 km     364.78 days
2016     Jan 02  22:49   0.9833039 AU    2097 km      Jul 04  16:24   1.0167509 AU    6080 km     363.68 days
2017     Jan 04  14:18   0.9833094 AU    2919 km      Jul 03  20:11   1.0166756 AU   -5190 km     367.65 days
2018     Jan 03  05:35   0.9832843 AU    -845 km      Jul 06  16:47   1.0166961 AU   -2129 km     363.64 days
2019     Jan 03  05:20   0.9833012 AU    1681 km      Jul 04  22:11   1.0167543 AU    6590 km     364.99 days
2020     Jan 05  07:48   0.9832436 AU   -6935 km      Jul 04  11:35   1.0166943 AU   -2399 km     367.10 days

2021     Jan 02  13:51   0.9832571 AU   -4916 km      Jul 05  22:27   1.0167292 AU    2832 km     363.25 days
2022     Jan 04  06:55   0.9833365 AU    6973 km      Jul 04  07:11   1.0167154 AU     760 km     366.71 days
2023     Jan 04  16:17   0.9832956 AU     845 km      Jul 06  20:07   1.0166806 AU   -4444 km     365.39 days
2024     Jan 03  00:39   0.9833070 AU    2553 km      Jul 05  05:06   1.0167255 AU    2273 km     363.35 days
2025     Jan 04  13:28   0.9833274 AU    5607 km      Jul 03  19:55   1.0166437 AU   -9957 km     367.53 days
2026     Jan 03  17:16   0.9833021 AU    1815 km      Jul 06  17:31   1.0166440 AU   -9920 km     364.16 days
2027     Jan 03  02:33   0.9833335 AU    6513 km      Jul 05  05:06   1.0167289 AU    2786 km     364.39 days
2028     Jan 05  12:28   0.9833074 AU    2608 km      Jul 03  22:18   1.0166798 AU   -4566 km     367.41 days
2029     Jan 02  18:13   0.9832917 AU     270 km      Jul 06  05:12   1.0167127 AU     362 km     363.24 days
2030     Jan 03  10:12   0.9833418 AU    7758 km      Jul 04  12:58   1.0167227 AU    1848 km     365.67 days



 * я использую эти значения
 * В результате расстояние Земли от Солнца (от центра до центра)
 * изменяется со средними значениями
 * 0,9832899 AU (147,098,074 км) в перигелии (ближайший)
 * до 1,0167103 AU (152,097,701 км) в афелии (самый отдаленный).
 * здесь же и хорошая таблица равноденствий на 100 лет
 * можно не заморачиваться на другие источники
 * парметры орбиты
 * http://astro-bratsk.ru/yearbook/342-perihelion-earth.html
 * перигелий (Perihelion) - 0.983 а.е.   147117000 км
 * афелий (Aphelion)     - 1.0167 а.е.  152083000 км    -
 * T = 365 дней 6 часов 9 мин 10 сек
 *  Равноденствие по UTC-0
 * https://ru.wikipedia.org/wiki/%D0%A0%D0%B0%D0%B2%D0%BD%D0%BE%D0%B4%D0%B5%D0%BD%D1%81%D1%82%D0%B2%D0%B8%D0%B5
2010 	20 	17:32:13
2011 	20 	23:21:44
2012 	20 	05:14:25
2013 	20 	11:02:55
2014 	20 	16:57:05
2015 	20 	22:45:09
2016 	20 	04:30:11
2017 	20 	10:28:38
2018 	20 	16:15:27
2019 	20 	21:58:25
2020 	20 	03:50:36
2021 	20 	09:37:27
2022 	20 	15:33:23
2023 	20 	21:24:24
2024 	20 	03:06:21
2025 	20 	09:01:25
 */

class EarthPar extends MoonPar
{
    protected $averPeriod = 365 + 6/24 + 9/(60*24) + 10/(24*3600);   // 365 дней 6 часов 9 мин 10 сек
    protected $averPeri = 0.983 ;          // AU средний перицентр
    protected $averApo = 1.0167 ;          // AU средний апоцентр
//==================================================//
    protected function getPerTab() {
        return $this->periTab() ;
    }

    /**
     * таблица для определения 0-левой даты <--> 0 угол
     * для Луны она совпадает с perTab
     * @return array
     */
    protected function getPerStartTab() {
        return $this->equinoxTab() ;
    }

    /**
     * таблица равнодненствий
     */
    private function  equinoxTab()
    {
        $equTab = [
            '2010-03-20 17:32:13',
            '2011-03-20 23:21:44',
            '2012-03-20 05:14:25',
            '2013-03-20 11:02:55',
            '2014-03-20 16:57:05',
            '2015-03-20 22:45:09',
            '2016-03-20 04:30:11',
            '2017-03-20 10:28:38',
            '2018-03-20 16:15:27',
            '2019-03-20 21:58:25',
            '2020-03-20 03:50:36',
            '2021-03-20 09:37:27',
            '2022-03-20 15:33:23',
            '2023-03-20 21:24:24',
            '2024-03-20 03:06:21',
            '2025-03-20 09:01:25',
        ];
        return $this->addTimestamp($equTab,true) ;
    }

    /**
     * таблица афелий (апоцентр)
     * @return mixed|void
     */
    protected function apoTab()
    {
        $apoTab = [
            '2011-07-04 14:54' => 1.0167404,
            '2012-07-05 03:32' => 1.0166751,
            '2013-07-05 14:44' => 1.0167085,
            '2014-07-04 00:13' => 1.0166816,
            '2015-07-06 19:40' => 1.0166821,
            '2016-07-04 16:24' => 1.0167509,
            '2017-07-03 20:11' => 1.0166756,
            '2018-07-06 16:47' => 1.0166961,
            '2019-07-04 22:11' => 1.0167543,
            '2020-07-04 11:35' => 1.0166943,
            '2021-07-05 22:27' => 1.0167292,
        ];
        return $this->addTimestamp($apoTab) ;
    }
    /**
     * таблица перигелий (перицентр)
     * @return mixed|void
     */
    protected function periTab() {
        $periTab = [
        '2011-01-03 18:32' =>   0.9833413,
        '2012-01-05 00:32' =>   0.9832841,
        '2013-01-02 04:38' =>   0.9832905,
        '2014-01-04 11:59' =>   0.9833347,
        '2015-01-04 06:36' =>   0.9832774,
        '2016-01-02 22:49' =>   0.9833039,
        '2017-01-04 14:18' =>   0.9833094,
        '2018-01-03 05:35' =>   0.9832843,
        '2019-01-03 05:20' =>   0.9833012,
        '2020-01-05 07:48' =>   0.9832436,
        '2021-01-02 13:51' =>   0.9832571,
        ] ;
        return $this->addTimestamp($periTab) ;

    }
}